
## :white_check_mark: Apply Succeeded (isucon)

[CI link](https://github.com/Shion1305/Shion1305-infra/actions/runs/11961933452)



<pre><code>Apply complete! Resources: 1 added, 1 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
oci_identity_compartment.main-compartment: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaaqi757kiz665ywkitzyetl7qz5jflrs3tzta4h5ksmwoyrbbfpt7q]
module.private-isu.oci_core_instance.isucon-instance: Refreshing state... [id=ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcyckv57chfqqlp6wwy66i4qcjrd563nidttj25rgy7esy3q]
oci_core_vcn.isucon-vcn: Refreshing state... [id=ocid1.vcn.oc1.ap-tokyo-1.amaaaaaaqiqkkcyaiejk27ditxbrx4ci3zh4t4g4nomlwgxggehjzuh5eddq]
oci_core_internet_gateway.isucon-internet-gateway: Refreshing state... [id=ocid1.internetgateway.oc1.ap-tokyo-1.aaaaaaaafbtlck23xu5kqexhmun75j6vgzihk2fli5gxs3ptysbb25qzwlea]
oci_core_dhcp_options.isucon-dhcp-options: Refreshing state... [id=ocid1.dhcpoptions.oc1.ap-tokyo-1.aaaaaaaassqicnrse3mqx7nqdha4geoox4mszrfcbzg5lokgv63frwhgrvwa]
oci_core_security_list.isucon-security-list: Refreshing state... [id=ocid1.securitylist.oc1.ap-tokyo-1.aaaaaaaaw3kzdg675la2b2abxm35s57eztsm2wik4a5hyaet4fbj4z3schua]
oci_core_route_table.isucon-routing-table: Refreshing state... [id=ocid1.routetable.oc1.ap-tokyo-1.aaaaaaaajv4saot5dfusxix54unjtcmqej3e4ong5ssmdvnfxkdilkkj6h6a]
oci_core_subnet.isucon-default: Refreshing state... [id=ocid1.subnet.oc1.ap-tokyo-1.aaaaaaaaaouhghd25suhw5wc5t5tmlcvmt5vsytmlzptz2ktfogapogfuikq]
module.private-isu2.oci_core_instance.isucon-instance: Refreshing state... [id=ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcyclrwm5bmk6uhxxbtjolg66cv7n3dnvrdyyy2xeo4glrwa]
module.private-isu-bench.oci_core_instance.isucon-instance: Refreshing state... [id=ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcycxsyhvpbkw6h6n7yokjt5qpn6ah2mhldr37ov5ut3a24a]
oci_core_public_ip.isu-1: Refreshing state... [id=ocid1.publicip.oc1.ap-tokyo-1.amaaaaaaqiqkkcyapfgyqhtwlhdcth3nprzkmgnvvdukx4p7m6xuonru3aqa]
module.private-isu2.data.oci_core_vnic_attachments.vnic_attachments: Reading...
module.private-isu-bench.data.oci_core_vnic_attachments.vnic_attachments: Reading...
module.private-isu2.data.oci_core_vnic_attachments.vnic_attachments: Read complete after 0s [id=CoreVnicAttachmentsDataSource-2089657333]
module.private-isu2.data.oci_core_vnic.instance_primary_vnic: Reading...
module.private-isu-bench.data.oci_core_vnic_attachments.vnic_attachments: Read complete after 0s [id=CoreVnicAttachmentsDataSource-365535014]
module.private-isu-bench.data.oci_core_vnic.instance_primary_vnic: Reading...
module.private-isu2.data.oci_core_vnic.instance_primary_vnic: Read complete after 1s [id=ocid1.vnic.oc1.ap-tokyo-1.abxhiljrzzh4qc54cwk3qphijwxwi2bua42fxlmglfnbfybkgizo6nqnxdga]
module.private-isu2.data.oci_core_private_ips.private_ips: Reading...
module.private-isu-bench.data.oci_core_vnic.instance_primary_vnic: Read complete after 1s [id=ocid1.vnic.oc1.ap-tokyo-1.abxhiljr7j3jq53ct4oni5fny5iwtaawky2nlhnporardnt5k3oyw7auaaxa]
module.private-isu-bench.data.oci_core_private_ips.private_ips: Reading...
module.private-isu2.data.oci_core_private_ips.private_ips: Read complete after 0s [id=CorePrivateIpsDataSource-1992613567]
oci_core_public_ip.isu-2: Refreshing state... [id=ocid1.publicip.oc1.ap-tokyo-1.amaaaaaaqiqkkcya42i3fhgp3ythfvuv37wwya5mop37luuenyyodnam5yfq]
module.private-isu-bench.data.oci_core_private_ips.private_ips: Read complete after 0s [id=CorePrivateIpsDataSource-1637059411]
oci_core_public_ip.isu-3: Refreshing state... [id=ocid1.publicip.oc1.ap-tokyo-1.amaaaaaaqiqkkcyapuxcjw2eot72rbn4tw52v4jncvtq55gdyaadypstiehq]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # oci_core_public_ip.isu-1 will be updated in-place
  ~ resource "oci_core_public_ip" "isu-1" {
        id                   = "ocid1.publicip.oc1.ap-tokyo-1.amaaaaaaqiqkkcyapfgyqhtwlhdcth3nprzkmgnvvdukx4p7m6xuonru3aqa"
      ~ private_ip_id        = "ocid1.privateip.oc1.ap-tokyo-1.abxhiljr7ndun6ckftvrz4xucyrxg4cf5nmzfgyizguqnfh6zthybl57agvq" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.private-isu.oci_core_instance.isucon-instance will be destroyed
  # (because oci_core_instance.isucon-instance is not in configuration)
  - resource "oci_core_instance" "isucon-instance" {
      - availability_domain         = "kbTA:AP-TOKYO-1-AD-1" -> null
      - boot_volume_id              = "ocid1.bootvolume.oc1.ap-tokyo-1.abxhiljrecwy3qwvklw2ywembxvlpriui6kvo7mdvrswffh7vo6cipnixppa" -> null
      - compartment_id              = "ocid1.compartment.oc1..aaaaaaaaqi757kiz665ywkitzyetl7qz5jflrs3tzta4h5ksmwoyrbbfpt7q" -> null
      - defined_tags                = {
          - "Oracle-Tags.CreatedBy" = "default/shion1305@gmail.com"
          - "Oracle-Tags.CreatedOn" = "2024-11-21T20:41:37.771Z"
        } -> null
      - display_name                = "private-isu" -> null
      - extended_metadata           = {} -> null
      - fault_domain                = "FAULT-DOMAIN-1" -> null
      - freeform_tags               = {} -> null
      - hostname_label              = "private-isu" -> null
      - id                          = "ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcyckv57chfqqlp6wwy66i4qcjrd563nidttj25rgy7esy3q" -> null
      - image                       = "ocid1.image.oc1.ap-tokyo-1.aaaaaaaadcb75lsmgfzxtrirj6l7rb7ecd4ivz7fwzi2py2kk2molifncsia" -> null
      - is_cross_numa_node          = false -> null
      - launch_mode                 = "PARAVIRTUALIZED" -> null
      - metadata                    = {
          - "ssh_authorized_keys" = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDIRAjRg8RNKQCicELQD2X6qixTrewrl608GAcxUF92+6D1WLLbJlVBG6Y41KunneRK4SyIWGlMqCaEGtk9ESspnqP0nHzQJtt5Io+7SwfAYqXPRk595quRcsgKY20JkPHvy1Su1whTsuZPRdXmEedw0maS+uRgeTPBSHzYEVvQ4sDhm+9SLlNNwqR9LrpnLARdeWnh/e7QiDFR8Gg/0hyubl3FFQxneM24DUHTFjRb6dig7AvPudc4YFcsyjGGMToiFr+o9siTaruN48G1UHsz4vo4plhgMuD8UBiq3ITtQHNr8n6Ndx93zktloMAg6AjZiHK+WwEypwKeZQqqkLm+I6n41PH/htEvTM0Gyntf2KKR4yqF48enWmKrfU495g+8V3Zm4YX6ZZ7E7+n+jqrVIPnvsRKP8CVfLp0XMuH79qYF/EC/lB7kF0pShJf15r/ZRhFFQcG2n57/sXOcq1pRLVMSi0gIIwH3ZpCXMDKKgtIwVc/fb3NRDyapiqdR72HMOAI0edXj11Vtc4DQHFnS7RIwQNIcH3fcS25rcrjDpkLYSUI1T2arWFwL7ZyVJIkA5i/LrMFvreVJX2c0fZTKehMEeIq/y3HOvC/8j879XqMiY5n0wiC2vf7Ej5da3PFXTveYokVxo95TheBJQSF4ZtlOtmJMYPw0DoLqVbOHxw== 141@Shion1305
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIOvVIyOe12vcMS623gUpyQJwJ5MlkivVGC+gqFYVDXQn 339@pirotyyy
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDl6MWbCtBxtX4nAT53LEa/KHaa5D2CN2VGaxxzdeTF/IUCgtIJFf86A1NJAVpYnP38ExJ08XLd3Ak8bsCnxn/0KziVoafYpuFXfnGEdT6juJwVKY8PrTz74+exTyobVjlnUJ+MXPdswGL2J9Dbl7HM+58aNjBu8eF8w3KTkcasUo6Uq62uA/9UWUa7f3OsuYEqT1+hsTvvxU5VvNA3kiBLSia3pRG2geacFMX26wQbdLnIY8btmpdzrEwYVi05vbIWQ0FoBX55O5KcwW6D4AIbzbRiS3T/i2fgYquOvvfRpUPS0G2OgYEWkM/fjv3laVpyLEOY8d4G1U4bpA/s2ZjhpLpyQpTzgT5u8QnAUlWPSv0UGbnMz/MQuzUGMR5Qt0liNonzwDPVierTSY+6LapO2ELreODaezglAfBcZ50mSFJ2XdZBJ4CwBiZF1GZM4Skj0xF+c1z3oL3+RKzW8mN8sJYPOSBzSrGxNY2LTEdvI3eXU8+yNdDfisksieIt7VU= 339@pirotyyy
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAHm+hM3PgBiVIaYLrq3SBPID/Mxqj6i4EUdZA8VR1R+ 339@pirotyyy
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIGrRRSZfDMXuryI15zfcISYP/sKd4wGaQSFzvPU2IGtX 339@pirotyyy
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAx7BOGitB4vaJwcwBB0cCIqA92iT3CiuSJk9p32nyC+ 339@pirotyyy
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIBVzbL/+E74JmTGXOpbXXnoFZklQRZ/9QAAgbeS3Li4K 339@pirotyyy
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDfKmdTHQsY2HjLvppBalIgmZ4a67p9vXSvG5z12PSJ1e/IezFJp2QxH2H3bCGk12ShWNteFyfvSompr1xoRYoz9wFZzCC42icY87GnGXMyyP2ds4YFRyPYAFlf+W7cKCj3WmAXWofJcd4kc2IIh47BHbjQm6UOu7N4AfTzkMtTBVUJnwYvnD3OgE4J6nrv9JfEHPDrWZuiQ9f93+LfC0lq5kw1TM6AZqleh89W4szWRviUZmc11mbf540r7BsSKYuzP7ZXvMYaHKCWaAvDuyKGezhgh7JqcWPXnxfP+DYMuULJjXaqOoLbGSvPhi1ABeE+QjTdXCuJhYMOj27V68N9tUzD7vyDyLU4Id7TuDAK+dPSZXNfsGrcMXFrBdbWI0PuRXyUH7zb2fRz4ZZMsq4HPSpfHcSOZm0D5ry1P4+iXwrpc9qHz4HxGt8U3xBBTpgaJLH1UQLDi4pmFnJm97A3FGsBn1WINS9uzpg8K0of8ABxc9hFv+Ne4czBHoO0yTc= 464@Ishigami100
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDQL9bQSjRaRBC7eCTk9BuSJdTsAU/6ZPTTIKTjlCYUb 464@Ishigami100
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEDPc6b4dbRcFAm72ezMV7H7lV7wuUCJ3Qqi73WiGrJN 464@Ishigami100
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILddcqb6jJ5gryEHeYg/oabRhHqXMJtMe4nyxU0WN3zd 464@Ishigami100
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIIXvWMWXEd2ZFVBhi5413ypo5EiPq0tlTqbIEWVAz95O 464@Ishigami100
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINVIh08icHE8RcQCsFoRc/p8WjNZoVxPc5YjEMBDPBzs 464@Ishigami100
            EOT
          - "user_data"           = "I2Nsb3VkLWNvbmZpZwoKdGltZXpvbmU6IEFzaWEvVG9reW8KcGFja2FnZV91cGRhdGU6IHRydWUKcGFja2FnZXM6CiAgLSBhbnNpYmxlCiAgLSBjdXJsCiAgLSBnaXQKICAtIHVuemlwCnJ1bmNtZDoKICAtIHwKICAgIHNldCAtZQoKICAgIEdJVERJUj0iL3RtcC9wcml2YXRlLWlzdSIKICAgIHJtIC1yZiAke0dJVERJUn0KICAgIGdpdCBjbG9uZSAtLWRlcHRoPTEgaHR0cHM6Ly9naXRodWIuY29tL1NoaW9uMTMwNS9wcml2YXRlLWlzdS5naXQgJHtHSVRESVJ9CiAgICBjZCAke0dJVERJUn0vcHJvdmlzaW9uaW5nLwogICAgc2VkIC1pICdzL2lzdS1hcHAvbG9jYWxob3N0IGFuc2libGVfY29ubmVjdGlvbj1sb2NhbC8nIGhvc3RzCiAgICBhbnNpYmxlLXBsYXlib29rIC1pIGhvc3RzIGltYWdlL2Fuc2libGUvcGxheWJvb2tzLnltbCAtLXNraXAtdGFncyBub2RlanMK"
        } -> null
      - private_ip                  = "10.0.0.203" -> null
      - public_ip                   = "138.3.213.241" -> null
      - region                      = "ap-tokyo-1" -> null
      - security_attributes         = {} -> null
      - security_attributes_state   = "STABLE" -> null
      - shape                       = "VM.Standard.A1.Flex" -> null
      - state                       = "RUNNING" -> null
      - subnet_id                   = "ocid1.subnet.oc1.ap-tokyo-1.aaaaaaaaaouhghd25suhw5wc5t5tmlcvmt5vsytmlzptz2ktfogapogfuikq" -> null
      - system_tags                 = {} -> null
      - time_created                = "2024-11-21 20:41:38.379 +0000 UTC" -> null
        # (1 unchanged attribute hidden)

      - agent_config {
          - are_all_plugins_disabled = false -> null
          - is_management_disabled   = false -> null
          - is_monitoring_disabled   = false -> null

          - plugins_config {
              - desired_state = "DISABLED" -> null
              - name          = "Vulnerability Scanning" -> null
            }
          - plugins_config {
              - desired_state = "DISABLED" -> null
              - name          = "Management Agent" -> null
            }
          - plugins_config {
              - desired_state = "ENABLED" -> null
              - name          = "Custom Logs Monitoring" -> null
            }
          - plugins_config {
              - desired_state = "DISABLED" -> null
              - name          = "Compute RDMA GPU Monitoring" -> null
            }
          - plugins_config {
              - desired_state = "ENABLED" -> null
              - name          = "Compute Instance Monitoring" -> null
            }
          - plugins_config {
              - desired_state = "DISABLED" -> null
              - name          = "Compute HPC RDMA Auto-Configuration" -> null
            }
          - plugins_config {
              - desired_state = "DISABLED" -> null
              - name          = "Compute HPC RDMA Authentication" -> null
            }
          - plugins_config {
              - desired_state = "ENABLED" -> null
              - name          = "Cloud Guard Workload Protection" -> null
            }
          - plugins_config {
              - desired_state = "DISABLED" -> null
              - name          = "Block Volume Management" -> null
            }
          - plugins_config {
              - desired_state = "DISABLED" -> null
              - name          = "Bastion" -> null
            }
        }

      - availability_config {
          - is_live_migration_preferred = true -> null
          - recovery_action             = "RESTORE_INSTANCE" -> null
        }

      - create_vnic_details {
          - assign_ipv6ip             = false -> null
          - assign_private_dns_record = false -> null
          - assign_public_ip          = "false" -> null
          - defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "default/shion1305@gmail.com"
              - "Oracle-Tags.CreatedOn" = "2024-11-21T20:41:37.903Z"
            } -> null
          - display_name              = "private-isu" -> null
          - freeform_tags             = {} -> null
          - hostname_label            = "private-isu" -> null
          - nsg_ids                   = [] -> null
          - private_ip                = "10.0.0.203" -> null
          - security_attributes       = {} -> null
          - skip_source_dest_check    = true -> null
          - subnet_id                 = "ocid1.subnet.oc1.ap-tokyo-1.aaaaaaaaaouhghd25suhw5wc5t5tmlcvmt5vsytmlzptz2ktfogapogfuikq" -> null
            # (1 unchanged attribute hidden)
        }

      - instance_options {
          - are_legacy_imds_endpoints_disabled = false -> null
        }

      - launch_options {
          - boot_volume_type                    = "PARAVIRTUALIZED" -> null
          - firmware                            = "UEFI_64" -> null
          - is_consistent_volume_naming_enabled = true -> null
          - is_pv_encryption_in_transit_enabled = false -> null
          - network_type                        = "PARAVIRTUALIZED" -> null
          - remote_data_volume_type             = "PARAVIRTUALIZED" -> null
        }

      - shape_config {
          - gpus                          = 0 -> null
          - local_disks                   = 0 -> null
          - local_disks_total_size_in_gbs = 0 -> null
          - max_vnic_attachments          = 2 -> null
          - memory_in_gbs                 = 6 -> null
          - networking_bandwidth_in_gbps  = 1 -> null
          - nvmes                         = 0 -> null
          - ocpus                         = 1 -> null
          - processor_description         = "3.0 GHz Ampere® Altra™" -> null
          - vcpus                         = 1 -> null
            # (3 unchanged attributes hidden)
        }

      - source_details {
          - boot_volume_size_in_gbs         = "50" -> null
          - boot_volume_vpus_per_gb         = "10" -> null
          - is_preserve_boot_volume_enabled = false -> null
          - source_id                       = "ocid1.image.oc1.ap-tokyo-1.aaaaaaaadcb75lsmgfzxtrirj6l7rb7ecd4ivz7fwzi2py2kk2molifncsia" -> null
          - source_type                     = "image" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.private-isu1.data.oci_core_private_ips.private_ips will be read during apply
  # (config refers to values not yet known)
 <= data "oci_core_private_ips" "private_ips" {
      + id          = (known after apply)
      + private_ips = (known after apply)
      + subnet_id   = "ocid1.subnet.oc1.ap-tokyo-1.aaaaaaaaaouhghd25suhw5wc5t5tmlcvmt5vsytmlzptz2ktfogapogfuikq"
      + vnic_id     = (known after apply)
    }

  # module.private-isu1.data.oci_core_vnic.instance_primary_vnic will be read during apply
  # (config refers to values not yet known)
 <= data "oci_core_vnic" "instance_primary_vnic" {
      + availability_domain    = (known after apply)
      + compartment_id         = (known after apply)
      + defined_tags           = (known after apply)
      + display_name           = (known after apply)
      + freeform_tags          = (known after apply)
      + hostname_label         = (known after apply)
      + id                     = (known after apply)
      + ipv6addresses          = (known after apply)
      + is_primary             = (known after apply)
      + mac_address            = (known after apply)
      + nsg_ids                = (known after apply)
      + private_ip_address     = (known after apply)
      + public_ip_address      = (known after apply)
      + security_attributes    = (known after apply)
      + skip_source_dest_check = (known after apply)
      + state                  = (known after apply)
      + subnet_id              = (known after apply)
      + time_created           = (known after apply)
      + vlan_id                = (known after apply)
      + vnic_id                = (known after apply)
    }

  # module.private-isu1.data.oci_core_vnic_attachments.vnic_attachments will be read during apply
  # (config refers to values not yet known)
 <= data "oci_core_vnic_attachments" "vnic_attachments" {
      + compartment_id   = "ocid1.compartment.oc1..aaaaaaaaqi757kiz665ywkitzyetl7qz5jflrs3tzta4h5ksmwoyrbbfpt7q"
      + id               = (known after apply)
      + instance_id      = (known after apply)
      + vnic_attachments = (known after apply)
    }

  # module.private-isu1.oci_core_instance.isucon-instance will be created
  + resource "oci_core_instance" "isucon-instance" {
      + availability_domain                 = "kbTA:AP-TOKYO-1-AD-1"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.compartment.oc1..aaaaaaaaqi757kiz665ywkitzyetl7qz5jflrs3tzta4h5ksmwoyrbbfpt7q"
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = "private-isu1"
      + extended_metadata                   = (known after apply)
      + fault_domain                        = "FAULT-DOMAIN-1"
      + freeform_tags                       = (known after apply)
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDIRAjRg8RNKQCicELQD2X6qixTrewrl608GAcxUF92+6D1WLLbJlVBG6Y41KunneRK4SyIWGlMqCaEGtk9ESspnqP0nHzQJtt5Io+7SwfAYqXPRk595quRcsgKY20JkPHvy1Su1whTsuZPRdXmEedw0maS+uRgeTPBSHzYEVvQ4sDhm+9SLlNNwqR9LrpnLARdeWnh/e7QiDFR8Gg/0hyubl3FFQxneM24DUHTFjRb6dig7AvPudc4YFcsyjGGMToiFr+o9siTaruN48G1UHsz4vo4plhgMuD8UBiq3ITtQHNr8n6Ndx93zktloMAg6AjZiHK+WwEypwKeZQqqkLm+I6n41PH/htEvTM0Gyntf2KKR4yqF48enWmKrfU495g+8V3Zm4YX6ZZ7E7+n+jqrVIPnvsRKP8CVfLp0XMuH79qYF/EC/lB7kF0pShJf15r/ZRhFFQcG2n57/sXOcq1pRLVMSi0gIIwH3ZpCXMDKKgtIwVc/fb3NRDyapiqdR72HMOAI0edXj11Vtc4DQHFnS7RIwQNIcH3fcS25rcrjDpkLYSUI1T2arWFwL7ZyVJIkA5i/LrMFvreVJX2c0fZTKehMEeIq/y3HOvC/8j879XqMiY5n0wiC2vf7Ej5da3PFXTveYokVxo95TheBJQSF4ZtlOtmJMYPw0DoLqVbOHxw== 141@Shion1305
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIOvVIyOe12vcMS623gUpyQJwJ5MlkivVGC+gqFYVDXQn 339@pirotyyy
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDl6MWbCtBxtX4nAT53LEa/KHaa5D2CN2VGaxxzdeTF/IUCgtIJFf86A1NJAVpYnP38ExJ08XLd3Ak8bsCnxn/0KziVoafYpuFXfnGEdT6juJwVKY8PrTz74+exTyobVjlnUJ+MXPdswGL2J9Dbl7HM+58aNjBu8eF8w3KTkcasUo6Uq62uA/9UWUa7f3OsuYEqT1+hsTvvxU5VvNA3kiBLSia3pRG2geacFMX26wQbdLnIY8btmpdzrEwYVi05vbIWQ0FoBX55O5KcwW6D4AIbzbRiS3T/i2fgYquOvvfRpUPS0G2OgYEWkM/fjv3laVpyLEOY8d4G1U4bpA/s2ZjhpLpyQpTzgT5u8QnAUlWPSv0UGbnMz/MQuzUGMR5Qt0liNonzwDPVierTSY+6LapO2ELreODaezglAfBcZ50mSFJ2XdZBJ4CwBiZF1GZM4Skj0xF+c1z3oL3+RKzW8mN8sJYPOSBzSrGxNY2LTEdvI3eXU8+yNdDfisksieIt7VU= 339@pirotyyy
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAHm+hM3PgBiVIaYLrq3SBPID/Mxqj6i4EUdZA8VR1R+ 339@pirotyyy
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIGrRRSZfDMXuryI15zfcISYP/sKd4wGaQSFzvPU2IGtX 339@pirotyyy
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAx7BOGitB4vaJwcwBB0cCIqA92iT3CiuSJk9p32nyC+ 339@pirotyyy
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIBVzbL/+E74JmTGXOpbXXnoFZklQRZ/9QAAgbeS3Li4K 339@pirotyyy
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDfKmdTHQsY2HjLvppBalIgmZ4a67p9vXSvG5z12PSJ1e/IezFJp2QxH2H3bCGk12ShWNteFyfvSompr1xoRYoz9wFZzCC42icY87GnGXMyyP2ds4YFRyPYAFlf+W7cKCj3WmAXWofJcd4kc2IIh47BHbjQm6UOu7N4AfTzkMtTBVUJnwYvnD3OgE4J6nrv9JfEHPDrWZuiQ9f93+LfC0lq5kw1TM6AZqleh89W4szWRviUZmc11mbf540r7BsSKYuzP7ZXvMYaHKCWaAvDuyKGezhgh7JqcWPXnxfP+DYMuULJjXaqOoLbGSvPhi1ABeE+QjTdXCuJhYMOj27V68N9tUzD7vyDyLU4Id7TuDAK+dPSZXNfsGrcMXFrBdbWI0PuRXyUH7zb2fRz4ZZMsq4HPSpfHcSOZm0D5ry1P4+iXwrpc9qHz4HxGt8U3xBBTpgaJLH1UQLDi4pmFnJm97A3FGsBn1WINS9uzpg8K0of8ABxc9hFv+Ne4czBHoO0yTc= 464@Ishigami100
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDQL9bQSjRaRBC7eCTk9BuSJdTsAU/6ZPTTIKTjlCYUb 464@Ishigami100
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEDPc6b4dbRcFAm72ezMV7H7lV7wuUCJ3Qqi73WiGrJN 464@Ishigami100
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILddcqb6jJ5gryEHeYg/oabRhHqXMJtMe4nyxU0WN3zd 464@Ishigami100
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIIXvWMWXEd2ZFVBhi5413ypo5EiPq0tlTqbIEWVAz95O 464@Ishigami100
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINVIh08icHE8RcQCsFoRc/p8WjNZoVxPc5YjEMBDPBzs 464@Ishigami100
            EOT
          + "user_data"           = "I2Nsb3VkLWNvbmZpZwoKdGltZXpvbmU6IEFzaWEvVG9reW8KcGFja2FnZV91cGRhdGU6IHRydWUKcGFja2FnZXM6CiAgLSBhbnNpYmxlCiAgLSBjdXJsCiAgLSBnaXQKICAtIHVuemlwCnJ1bmNtZDoKICAtIHwKICAgIHNldCAtZQoKICAgIEdJVERJUj0iL3RtcC9wcml2YXRlLWlzdSIKICAgIHJtIC1yZiAke0dJVERJUn0KICAgIGdpdCBjbG9uZSAtLWRlcHRoPTEgaHR0cHM6Ly9naXRodWIuY29tL1NoaW9uMTMwNS9wcml2YXRlLWlzdS5naXQgJHtHSVRESVJ9CiAgICBjZCAke0dJVERJUn0vcHJvdmlzaW9uaW5nLwogICAgc2VkIC1pICdzL2lzdS1hcHAvbG9jYWxob3N0IGFuc2libGVfY29ubmVjdGlvbj1sb2NhbC8nIGhvc3RzCiAgICBhbnNpYmxlLXBsYXlib29rIC1pIGhvc3RzIGltYWdlL2Fuc2libGUvcGxheWJvb2tzLnltbCAtLXNraXAtdGFncyBub2RlanMK"
        }
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + security_attributes                 = (known after apply)
      + security_attributes_state           = (known after apply)
      + shape                               = "VM.Standard.A1.Flex"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + agent_config {
          + are_all_plugins_disabled = false
          + is_management_disabled   = false
          + is_monitoring_disabled   = false

          + plugins_config {
              + desired_state = "DISABLED"
              + name          = "Vulnerability Scanning"
            }
          + plugins_config {
              + desired_state = "DISABLED"
              + name          = "Management Agent"
            }
          + plugins_config {
              + desired_state = "ENABLED"
              + name          = "Custom Logs Monitoring"
            }
          + plugins_config {
              + desired_state = "DISABLED"
              + name          = "Compute RDMA GPU Monitoring"
            }
          + plugins_config {
              + desired_state = "ENABLED"
              + name          = "Compute Instance Monitoring"
            }
          + plugins_config {
              + desired_state = "DISABLED"
              + name          = "Compute HPC RDMA Auto-Configuration"
            }
          + plugins_config {
              + desired_state = "DISABLED"
              + name          = "Compute HPC RDMA Authentication"
            }
          + plugins_config {
              + desired_state = "ENABLED"
              + name          = "Cloud Guard Workload Protection"
            }
          + plugins_config {
              + desired_state = "DISABLED"
              + name          = "Block Volume Management"
            }
          + plugins_config {
              + desired_state = "DISABLED"
              + name          = "Bastion"
            }
        }

      + availability_config {
          + is_live_migration_preferred = true
          + recovery_action             = "RESTORE_INSTANCE"
        }

      + create_vnic_details {
          + assign_ipv6ip          = (known after apply)
          + assign_public_ip       = "false"
          + defined_tags           = (known after apply)
          + display_name           = "private-isu1"
          + freeform_tags          = (known after apply)
          + hostname_label         = (known after apply)
          + nsg_ids                = (known after apply)
          + private_ip             = (known after apply)
          + security_attributes    = (known after apply)
          + skip_source_dest_check = true
          + subnet_id              = "ocid1.subnet.oc1.ap-tokyo-1.aaaaaaaaaouhghd25suhw5wc5t5tmlcvmt5vsytmlzptz2ktfogapogfuikq"
          + vlan_id                = (known after apply)

          + ipv6address_ipv6subnet_cidr_pair_details (known after apply)
        }

      + instance_options {
          + are_legacy_imds_endpoints_disabled = false
        }

      + launch_options {
          + boot_volume_type                    = "PARAVIRTUALIZED"
          + firmware                            = "UEFI_64"
          + is_consistent_volume_naming_enabled = true
          + is_pv_encryption_in_transit_enabled = (known after apply)
          + network_type                        = "PARAVIRTUALIZED"
          + remote_data_volume_type             = "PARAVIRTUALIZED"
        }

      + launch_volume_attachments (known after apply)

      + platform_config (known after apply)

      + preemptible_instance_config (known after apply)

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = 6
          + networking_bandwidth_in_gbps  = (known after apply)
          + nvmes                         = (known after apply)
          + ocpus                         = 1
          + processor_description         = (known after apply)
          + vcpus                         = 1
        }

      + source_details {
          + boot_volume_size_in_gbs         = "50"
          + boot_volume_vpus_per_gb         = "10"
          + is_preserve_boot_volume_enabled = false
          + source_id                       = "ocid1.image.oc1.ap-tokyo-1.aaaaaaaadcb75lsmgfzxtrirj6l7rb7ecd4ivz7fwzi2py2kk2molifncsia"
          + source_type                     = "image"

          + instance_source_image_filter_details (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
module.private-isu.oci_core_instance.isucon-instance: Destroying... [id=ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcyckv57chfqqlp6wwy66i4qcjrd563nidttj25rgy7esy3q]
module.private-isu1.oci_core_instance.isucon-instance: Creating...
module.private-isu.oci_core_instance.isucon-instance: Still destroying... [id=ocid1.instance.oc1.ap-tokyo-1.anxhiljrq...fqqlp6wwy66i4qcjrd563nidttj25rgy7esy3q, 10s elapsed]
module.private-isu1.oci_core_instance.isucon-instance: Still creating... [10s elapsed]
module.private-isu.oci_core_instance.isucon-instance: Still destroying... [id=ocid1.instance.oc1.ap-tokyo-1.anxhiljrq...fqqlp6wwy66i4qcjrd563nidttj25rgy7esy3q, 20s elapsed]
module.private-isu1.oci_core_instance.isucon-instance: Still creating... [20s elapsed]
module.private-isu.oci_core_instance.isucon-instance: Still destroying... [id=ocid1.instance.oc1.ap-tokyo-1.anxhiljrq...fqqlp6wwy66i4qcjrd563nidttj25rgy7esy3q, 30s elapsed]
module.private-isu1.oci_core_instance.isucon-instance: Still creating... [30s elapsed]
module.private-isu1.oci_core_instance.isucon-instance: Creation complete after 39s [id=ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcycixfzbrdrfjdxbhedgqfkh7p2r5yxyboqgmvhvl7tku2a]
module.private-isu1.data.oci_core_vnic_attachments.vnic_attachments: Reading...
module.private-isu.oci_core_instance.isucon-instance: Still destroying... [id=ocid1.instance.oc1.ap-tokyo-1.anxhiljrq...fqqlp6wwy66i4qcjrd563nidttj25rgy7esy3q, 40s elapsed]
module.private-isu1.data.oci_core_vnic_attachments.vnic_attachments: Read complete after 1s [id=CoreVnicAttachmentsDataSource-3231100573]
module.private-isu1.data.oci_core_vnic.instance_primary_vnic: Reading...
module.private-isu1.data.oci_core_vnic.instance_primary_vnic: Read complete after 1s [id=ocid1.vnic.oc1.ap-tokyo-1.abxhiljrmbicadjdt53tjvq4suxwezvl7x7frhmegfspylhyfzhmtsu7mdfq]
module.private-isu1.data.oci_core_private_ips.private_ips: Reading...
module.private-isu1.data.oci_core_private_ips.private_ips: Read complete after 0s [id=CorePrivateIpsDataSource-2488898987]
module.private-isu.oci_core_instance.isucon-instance: Still destroying... [id=ocid1.instance.oc1.ap-tokyo-1.anxhiljrq...fqqlp6wwy66i4qcjrd563nidttj25rgy7esy3q, 50s elapsed]
module.private-isu.oci_core_instance.isucon-instance: Destruction complete after 57s
oci_core_public_ip.isu-1: Modifying... [id=ocid1.publicip.oc1.ap-tokyo-1.amaaaaaaqiqkkcyapfgyqhtwlhdcth3nprzkmgnvvdukx4p7m6xuonru3aqa]
oci_core_public_ip.isu-1: Modifications complete after 1s [id=ocid1.publicip.oc1.ap-tokyo-1.amaaaaaaqiqkkcyapfgyqhtwlhdcth3nprzkmgnvvdukx4p7m6xuonru3aqa]

Apply complete! Resources: 1 added, 1 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"run-terragrunt-apply","PRNumber":22,"Program":"tfcmt","SHA1":"b0b12390ff3f9e1eb906bd3052636f3196967e49","Target":"isucon","Vars":{},"WorkflowName":"Run Apply on OCI"} -->